{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "277fcb2c",
   "metadata": {},
   "source": [
    "## NOTEBOOK TO EXTRACT ROW FILES OF ARTGRAPH QUERYING THE DATABASE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5d3d6fae",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5e305e60",
   "metadata": {},
   "source": [
    "### CONNECTION TO DATABASE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "f6371a1f",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(uri = \"bolt://localhost:7687\", auth = ('neo4j','neo4j'))#place here credentials"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "395b23f3",
   "metadata": {},
   "source": [
    "### LOADING ARTEMIS DATASET"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "eeecbe5a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>painting</th>\n",
       "      <th>emotion</th>\n",
       "      <th>time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>a.y.-jackson_algoma-in-november-1935.jpg</td>\n",
       "      <td>awe</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>a.y.-jackson_algoma-in-november-1935.jpg</td>\n",
       "      <td>fear</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>a.y.-jackson_barns-1926.jpg</td>\n",
       "      <td>amusement</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>a.y.-jackson_barns-1926.jpg</td>\n",
       "      <td>awe</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>a.y.-jackson_barns-1926.jpg</td>\n",
       "      <td>contentment</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269286</th>\n",
       "      <td>zinaida-serebriakova_young-moroccan-1932.jpg</td>\n",
       "      <td>amusement</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269287</th>\n",
       "      <td>zinaida-serebriakova_young-moroccan-1932.jpg</td>\n",
       "      <td>awe</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269288</th>\n",
       "      <td>zinaida-serebriakova_young-moroccan-1932.jpg</td>\n",
       "      <td>contentment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269289</th>\n",
       "      <td>zinaida-serebriakova_young-moroccan-1932.jpg</td>\n",
       "      <td>excitement</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269290</th>\n",
       "      <td>zinaida-serebriakova_young-moroccan-1932.jpg</td>\n",
       "      <td>something else</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>269291 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            painting         emotion  time\n",
       "0           a.y.-jackson_algoma-in-november-1935.jpg             awe     1\n",
       "1           a.y.-jackson_algoma-in-november-1935.jpg            fear     4\n",
       "2                        a.y.-jackson_barns-1926.jpg       amusement     1\n",
       "3                        a.y.-jackson_barns-1926.jpg             awe     2\n",
       "4                        a.y.-jackson_barns-1926.jpg     contentment     2\n",
       "...                                              ...             ...   ...\n",
       "269286  zinaida-serebriakova_young-moroccan-1932.jpg       amusement     1\n",
       "269287  zinaida-serebriakova_young-moroccan-1932.jpg             awe     1\n",
       "269288  zinaida-serebriakova_young-moroccan-1932.jpg     contentment     1\n",
       "269289  zinaida-serebriakova_young-moroccan-1932.jpg      excitement     1\n",
       "269290  zinaida-serebriakova_young-moroccan-1932.jpg  something else     1\n",
       "\n",
       "[269291 rows x 3 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "artemis = pd.read_csv('artemis_emotion_all.csv')\n",
    "artemis"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e119af45",
   "metadata": {},
   "source": [
    "### GETTING ALL ARTWORKS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "7ca1d7f5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['giuseppe-arcimboldo_portrait-of-eve-1578.jpg', 'giuseppe-arcimboldo_portrait-of-adam-1578.jpg', 'giuseppe-arcimboldo_the-vegetable-bowl.jpg', 'giuseppe-arcimboldo_vertumnus-emperor-rudolph-ii.jpg', 'giuseppe-arcimboldo_self-portrait.jpg', 'giuseppe-arcimboldo_the-dinner.jpg', 'frida-kahlo_a-few-small-nips-passionately-in-love-1935.jpg', 'frida-kahlo_coconuts-1951.jpg', 'frida-kahlo_congress-of-peoples-for-peace-1952.jpg', 'frida-kahlo_diego-and-i-1949.jpg']\n"
     ]
    }
   ],
   "source": [
    "with driver.session(database='test') as session:\n",
    "    ans = session.run(f\"\"\"MATCH (a:Artwork) RETURN a.name\"\"\")\n",
    "    result = [record['a.name'] for record in ans]\n",
    "    print(result[:10])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cf472fed",
   "metadata": {},
   "source": [
    "### INTERSECTION BETWEEN ARTGRAPH AND ARTEMIS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "46765d9f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "65236\n"
     ]
    }
   ],
   "source": [
    "artemis_artworks = artemis.painting.unique().tolist()\n",
    "common = set(result).intersection(set(artemis_artworks))\n",
    "print(len(common))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "959ea506",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>painting</th>\n",
       "      <th>emotion</th>\n",
       "      <th>time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>188</th>\n",
       "      <td>abdullah-suriosubroto_air-terjun.jpg</td>\n",
       "      <td>awe</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>189</th>\n",
       "      <td>abdullah-suriosubroto_air-terjun.jpg</td>\n",
       "      <td>contentment</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>190</th>\n",
       "      <td>abdullah-suriosubroto_bamboo-forest.jpg</td>\n",
       "      <td>awe</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>191</th>\n",
       "      <td>abdullah-suriosubroto_bamboo-forest.jpg</td>\n",
       "      <td>contentment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>192</th>\n",
       "      <td>abdullah-suriosubroto_bamboo-forest.jpg</td>\n",
       "      <td>excitement</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269286</th>\n",
       "      <td>zinaida-serebriakova_young-moroccan-1932.jpg</td>\n",
       "      <td>amusement</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269287</th>\n",
       "      <td>zinaida-serebriakova_young-moroccan-1932.jpg</td>\n",
       "      <td>awe</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269288</th>\n",
       "      <td>zinaida-serebriakova_young-moroccan-1932.jpg</td>\n",
       "      <td>contentment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269289</th>\n",
       "      <td>zinaida-serebriakova_young-moroccan-1932.jpg</td>\n",
       "      <td>excitement</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>269290</th>\n",
       "      <td>zinaida-serebriakova_young-moroccan-1932.jpg</td>\n",
       "      <td>something else</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>217131 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            painting         emotion  time\n",
       "188             abdullah-suriosubroto_air-terjun.jpg             awe     3\n",
       "189             abdullah-suriosubroto_air-terjun.jpg     contentment     2\n",
       "190          abdullah-suriosubroto_bamboo-forest.jpg             awe     2\n",
       "191          abdullah-suriosubroto_bamboo-forest.jpg     contentment     1\n",
       "192          abdullah-suriosubroto_bamboo-forest.jpg      excitement     2\n",
       "...                                              ...             ...   ...\n",
       "269286  zinaida-serebriakova_young-moroccan-1932.jpg       amusement     1\n",
       "269287  zinaida-serebriakova_young-moroccan-1932.jpg             awe     1\n",
       "269288  zinaida-serebriakova_young-moroccan-1932.jpg     contentment     1\n",
       "269289  zinaida-serebriakova_young-moroccan-1932.jpg      excitement     1\n",
       "269290  zinaida-serebriakova_young-moroccan-1932.jpg  something else     1\n",
       "\n",
       "[217131 rows x 3 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "artgraph_artemis = artemis[artemis.painting.isin(common)]\n",
    "artgraph_artemis"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aaefc263",
   "metadata": {},
   "source": [
    "### CREATING EMOTION EDGES"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "fffb99cd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "188       MATCH (a:Artwork{name:\"abdullah-suriosubroto_a...\n",
       "189       MATCH (a:Artwork{name:\"abdullah-suriosubroto_a...\n",
       "190       MATCH (a:Artwork{name:\"abdullah-suriosubroto_b...\n",
       "191       MATCH (a:Artwork{name:\"abdullah-suriosubroto_b...\n",
       "192       MATCH (a:Artwork{name:\"abdullah-suriosubroto_b...\n",
       "                                ...                        \n",
       "269286    MATCH (a:Artwork{name:\"zinaida-serebriakova_yo...\n",
       "269287    MATCH (a:Artwork{name:\"zinaida-serebriakova_yo...\n",
       "269288    MATCH (a:Artwork{name:\"zinaida-serebriakova_yo...\n",
       "269289    MATCH (a:Artwork{name:\"zinaida-serebriakova_yo...\n",
       "269290    MATCH (a:Artwork{name:\"zinaida-serebriakova_yo...\n",
       "Length: 217131, dtype: object"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "creation_edges = artgraph_artemis.apply(lambda x: \"\"\"MATCH (a:Artwork{name:\\\"\"\"\" + x[0] + \"\"\"\\\"})\n",
    "MERGE (e:Emotion{name:\\\"\"\"\" + x[1] + \"\"\"\\\"})\n",
    "CREATE (a)-[r: elicit{arousal: \"\"\" + str(x[2]) + \"}]->(e)\", axis = 1)\n",
    "creation_edges"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "62c5f502",
   "metadata": {},
   "source": [
    "### SAVING TO FILE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "7f69b9d8",
   "metadata": {},
   "outputs": [],
   "source": [
    "save = False"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "bfe56266",
   "metadata": {},
   "outputs": [],
   "source": [
    "if save:\n",
    "    with open('emotion.cypher','w') as file:\n",
    "        creation_edges.map(lambda x: print(x, file = file, end = '\\n\\n'))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c3a6c684",
   "metadata": {},
   "source": [
    "### SAVING TO DB (requires 6h)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "27b1719a",
   "metadata": {},
   "outputs": [],
   "source": [
    "if save:\n",
    "    with driver.session(database='test') as session:\n",
    "        creation_edges.map(lambda x: session.run(x))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "94ac0345",
   "metadata": {},
   "source": [
    "### EXTRACTING ROW FILE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "fb2d515c",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'genre': 'MATCH (n:Genre) RETURN n.name as name',\n",
       " 'style': 'MATCH (n:Style) RETURN n.name as name',\n",
       " 'artist': 'MATCH (n:Artist) RETURN n.name as name',\n",
       " 'media': 'MATCH (n:Media) RETURN n.name as name',\n",
       " 'tag': 'MATCH (n:Tag) RETURN n.name as name',\n",
       " 'artwork': 'MATCH (n:Artwork) RETURN n.name as name',\n",
       " 'movement': 'MATCH (n:Movement) RETURN n.name as name',\n",
       " 'training': 'MATCH (n:Training) RETURN n.name as name',\n",
       " 'serie': 'MATCH (n:Serie) RETURN n.name as name',\n",
       " 'subject': 'MATCH (n:Subject) RETURN n.name as name',\n",
       " 'field': 'MATCH (n:Field) RETURN n.name as name',\n",
       " 'people': 'MATCH (n:People) RETURN n.name as name',\n",
       " 'period': 'MATCH (n:Period) RETURN n.name as name',\n",
       " 'gallery': 'MATCH (n:Gallery) RETURN n.name as name',\n",
       " 'city': 'MATCH (n:City) RETURN n.name as name',\n",
       " 'country': 'MATCH (n:Country) RETURN n.name as name',\n",
       " 'emotion': 'MATCH (n:Emotion) RETURN n.name as name',\n",
       " 'rel': 'MATCH (n)-[r]-(n2) RETURN DISTINCT toLower(type(r)) as rel_label'}"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with driver.session(database='test') as session:#place here the database name (not project name)\n",
    "    node_types = session.run(\"MATCH(n) RETURN  DISTINCT labels(n)[0] as typen\")#getting all node types\n",
    "    node_types = [record['typen'] for record in node_types]#extracting data into a list\n",
    "mapping_queries = {node.lower(): f\"MATCH (n:{node}) RETURN n.name as name\" for node in node_types}#generating queries for ndoe types\n",
    "mapping_queries['rel'] = \"MATCH (n)-[r]-(n2) RETURN DISTINCT toLower(type(r)) as rel_label\"#generating queries for edge types\n",
    "mapping_queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "2249f5d2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'genre': 'MATCH (n:Genre) RETURN n.name, ID(n) as nodeId',\n",
       " 'style': 'MATCH (n:Style) RETURN n.name, ID(n) as nodeId',\n",
       " 'artist': 'MATCH (n:Artist) RETURN n.name, ID(n) as nodeId',\n",
       " 'media': 'MATCH (n:Media) RETURN n.name, ID(n) as nodeId',\n",
       " 'tag': 'MATCH (n:Tag) RETURN n.name, ID(n) as nodeId',\n",
       " 'artwork': 'MATCH (n:Artwork) RETURN n.name, ID(n) as nodeId',\n",
       " 'movement': 'MATCH (n:Movement) RETURN n.name, ID(n) as nodeId',\n",
       " 'training': 'MATCH (n:Training) RETURN n.name, ID(n) as nodeId',\n",
       " 'serie': 'MATCH (n:Serie) RETURN n.name, ID(n) as nodeId',\n",
       " 'subject': 'MATCH (n:Subject) RETURN n.name, ID(n) as nodeId',\n",
       " 'field': 'MATCH (n:Field) RETURN n.name, ID(n) as nodeId',\n",
       " 'people': 'MATCH (n:People) RETURN n.name, ID(n) as nodeId',\n",
       " 'period': 'MATCH (n:Period) RETURN n.name, ID(n) as nodeId',\n",
       " 'gallery': 'MATCH (n:Gallery) RETURN n.name, ID(n) as nodeId',\n",
       " 'city': 'MATCH (n:City) RETURN n.name, ID(n) as nodeId',\n",
       " 'country': 'MATCH (n:Country) RETURN n.name, ID(n) as nodeId',\n",
       " 'emotion': 'MATCH (n:Emotion) RETURN n.name, ID(n) as nodeId'}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "node_id_mapping_queries = {node.lower(): f\"MATCH (n:{node}) RETURN n.name, ID(n) as nodeId\" for node in node_types}\n",
    "node_id_mapping_queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "fe4e4970",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{\"('artist', 'belongstomovement', 'movement')\": 'MATCH (a:Artist)-[r:belongsToMovement]->(b:Movement) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artist', 'hassubject', 'subject')\": 'MATCH (a:Artist)-[r:hasSubject]->(b:Subject) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artist', 'relatedtoschool', 'training')\": 'MATCH (a:Artist)-[r:relatedToSchool]->(b:Training) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artist', 'belongstofield', 'field')\": 'MATCH (a:Artist)-[r:belongsToField]->(b:Field) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artist', 'trainedby', 'artist')\": 'MATCH (a:Artist)-[r:trainedBy]->(b:Artist) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artist', 'haspatron', 'people')\": 'MATCH (a:Artist)-[r:hasPatron]->(b:People) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'madeof', 'media')\": 'MATCH (a:Artwork)-[r:madeOf]->(b:Media) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'about', 'tag')\": 'MATCH (a:Artwork)-[r:about]->(b:Tag) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'createdby', 'artist')\": 'MATCH (a:Artwork)-[r:createdBy]->(b:Artist) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'partof', 'serie')\": 'MATCH (a:Artwork)-[r:partOf]->(b:Serie) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'hasstyle', 'style')\": 'MATCH (a:Artwork)-[r:hasStyle]->(b:Style) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'hasgenre', 'genre')\": 'MATCH (a:Artwork)-[r:hasGenre]->(b:Genre) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'locatedin', 'city')\": 'MATCH (a:Artwork)-[r:locatedIn]->(b:City) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'locatedin', 'country')\": 'MATCH (a:Artwork)-[r:locatedIn]->(b:Country) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'locatedin', 'gallery')\": 'MATCH (a:Artwork)-[r:locatedIn]->(b:Gallery) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'elicit', 'emotion')\": 'MATCH (a:Artwork)-[r:elicit]->(b:Emotion) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'hasperiod', 'period')\": 'MATCH (a:Artwork)-[r:hasPeriod]->(b:Period) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('gallery', 'incountry', 'country')\": 'MATCH (a:Gallery)-[r:inCountry]->(b:Country) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('gallery', 'incity', 'city')\": 'MATCH (a:Gallery)-[r:inCity]->(b:City) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('city', 'incountry', 'country')\": 'MATCH (a:City)-[r:inCountry]->(b:Country) RETURN a.name as source_name, b.name as dest_name'}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with driver.session(database='test') as session:\n",
    "    triplets = session.run(\"MATCH p=(a)-[r]->(b) RETURN DISTINCT labels(a)[0] as source, type(r) as relation,  labels(b)[0] as destination\")\n",
    "    triplets = [(t['source'], t['relation'], t['destination']) for t in triplets]\n",
    "relation_queries = {str(tuple(map(lambda x:x.lower(),t))): f\"MATCH (a:{t[0]})-[r:{t[1]}]->(b:{t[2]}) RETURN a.name as source_name, b.name as dest_name\"\n",
    "                    for t in triplets}\n",
    "relation_queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0f1b968b",
   "metadata": {},
   "source": [
    "#change emotion triplet query in order to have only the best emotion\n",
    "#we need a change\n",
    "relation_queries[\"('artwork', 'elicits', 'emotion')\"] = \"MATCH (a:Artwork)-[r1:elicit]->(e1:Emotion) with a, max(r1.arousal) as max_arousal match(a)-[r2:elicit]->(e2:Emotion) where r2.arousal = max_arousal RETURN a.name as source_name, collect(e2.name)[0] as dest_name\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5ef29bd2",
   "metadata": {},
   "outputs": [],
   "source": [
    "#here is the change\n",
    "relation_queries[\"('artwork', 'elicits', 'emotion')\"] = \"\"\"\n",
    "match(a:Artwork)-[r]-(e:Emotion)\n",
    "with a, sum(r.arousal) as sum_arousal, e\n",
    "with a, max(sum_arousal) as max_arousal\n",
    "match(a)-[r2]-(e2:Emotion)\n",
    "with a, sum(r2.arousal) as sum2, e2, max_arousal\n",
    "where sum2 = max_arousal\n",
    "return a.name as source_name, collect(e2.name)[0] as dest_name\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "07d3f462",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{\"('artist', 'belongstomovement', 'movement')\": 'MATCH (a:Artist)-[r:belongsToMovement]->(b:Movement) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artist', 'hassubject', 'subject')\": 'MATCH (a:Artist)-[r:hasSubject]->(b:Subject) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artist', 'relatedtoschool', 'training')\": 'MATCH (a:Artist)-[r:relatedToSchool]->(b:Training) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artist', 'belongstofield', 'field')\": 'MATCH (a:Artist)-[r:belongsToField]->(b:Field) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artist', 'trainedby', 'artist')\": 'MATCH (a:Artist)-[r:trainedBy]->(b:Artist) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artist', 'haspatron', 'people')\": 'MATCH (a:Artist)-[r:hasPatron]->(b:People) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'madeof', 'media')\": 'MATCH (a:Artwork)-[r:madeOf]->(b:Media) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'about', 'tag')\": 'MATCH (a:Artwork)-[r:about]->(b:Tag) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'createdby', 'artist')\": 'MATCH (a:Artwork)-[r:createdBy]->(b:Artist) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'partof', 'serie')\": 'MATCH (a:Artwork)-[r:partOf]->(b:Serie) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'hasstyle', 'style')\": 'MATCH (a:Artwork)-[r:hasStyle]->(b:Style) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'hasgenre', 'genre')\": 'MATCH (a:Artwork)-[r:hasGenre]->(b:Genre) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'locatedin', 'city')\": 'MATCH (a:Artwork)-[r:locatedIn]->(b:City) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'locatedin', 'country')\": 'MATCH (a:Artwork)-[r:locatedIn]->(b:Country) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'locatedin', 'gallery')\": 'MATCH (a:Artwork)-[r:locatedIn]->(b:Gallery) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('artwork', 'elicit', 'emotion')\": 'MATCH (a:Artwork)-[r1:elicit]->(e1:Emotion) with a, max(r1.arousal) as max_arousal match(a)-[r2:elicit]->(e2:Emotion) where r2.arousal = max_arousal RETURN a.name as source_name, collect(e2.name)[0] as dest_name',\n",
       " \"('artwork', 'hasperiod', 'period')\": 'MATCH (a:Artwork)-[r:hasPeriod]->(b:Period) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('gallery', 'incountry', 'country')\": 'MATCH (a:Gallery)-[r:inCountry]->(b:Country) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('gallery', 'incity', 'city')\": 'MATCH (a:Gallery)-[r:inCity]->(b:City) RETURN a.name as source_name, b.name as dest_name',\n",
       " \"('city', 'incountry', 'country')\": 'MATCH (a:City)-[r:inCountry]->(b:Country) RETURN a.name as source_name, b.name as dest_name'}"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "relation_queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "391d5461",
   "metadata": {},
   "outputs": [],
   "source": [
    "#useless\n",
    "stat_queries = {\n",
    "\"node_labels_stats\" : \"MATCH (n) RETURN distinct labels(n) as node_label, count(*) as count\",\n",
    "\"rel_labels_stats\" : \"MATCH (n)-[r]->(n2) RETURN distinct type(r) as rel_label, count(*) as count\",\n",
    "\"triplet-type-list\" : \"MATCH (x)-[r]->(y) RETURN distinct HEAD(labels(x)) as head, type(r), head(labels(y)) as tail\"\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "2c8b21d0",
   "metadata": {},
   "outputs": [],
   "source": [
    "from raw_generation import ArtGraphWithSplit\n",
    "conf = {\n",
    "    \"uri\": \"bolt://localhost:7687\",\n",
    "    \"username\": \"neo4j\",\n",
    "    \"password\": 'neo4j',\n",
    "    \"database\": \"test\"\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "e3f2d880",
   "metadata": {},
   "outputs": [],
   "source": [
    "queries = {\n",
    "    'mapping': mapping_queries,\n",
    "    'relations': relation_queries,\n",
    "    'stats': stat_queries\n",
    "}\n",
    "\n",
    "labels = []"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "e86e4e43",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "split_paths = {\n",
    "  'train': os.path.join(\"split\", \"train.csv\"),\n",
    "  'valid':os.path.join(\"split\", \"valid.csv\"),\n",
    "  'test':os.path.join(\"split\", \"test.csv\")\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "a134af73",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Getting mapping...\n",
      "Getting split...\n",
      "Getting relations...\n",
      "             source_name                   dest_name\n",
      "0             john-crome  Norwich School of painters\n",
      "1        christo-coetzee        Neo-Baroque painting\n",
      "2               otto-dix             New Objectivity\n",
      "3        christian-schad             New Objectivity\n",
      "4         adolf-dietrich             New Objectivity\n",
      "...                  ...                         ...\n",
      "1051    viktor-vasnetsov            History painting\n",
      "1052  elizabeth-thompson            History painting\n",
      "1053         jan-matejko            History painting\n",
      "1054          paul-brach    Minimalism (visual arts)\n",
      "1055        frank-stella    Minimalism (visual arts)\n",
      "\n",
      "[1056 rows x 2 columns]\n",
      "                     source_name  \\\n",
      "0               jeremy-henderson   \n",
      "1               jeremy-henderson   \n",
      "2               jeremy-henderson   \n",
      "3      christian-ludwig-attersee   \n",
      "4      christian-ludwig-attersee   \n",
      "...                          ...   \n",
      "21049           alexander-ivanov   \n",
      "21050           alexander-ivanov   \n",
      "21051           alexander-ivanov   \n",
      "21052           alexander-ivanov   \n",
      "21053           alexander-ivanov   \n",
      "\n",
      "                                               dest_name  \n",
      "0                                            2009 deaths  \n",
      "1                                        British artists  \n",
      "2                                            1952 births  \n",
      "3                              21st-century male artists  \n",
      "4                              20th-century male artists  \n",
      "...                                                  ...  \n",
      "21049  Awarded with a large gold medal of the Academy...  \n",
      "21050                    Imperial Academy of Arts alumni  \n",
      "21051                      19th-century Russian painters  \n",
      "21052                       People from Saint Petersburg  \n",
      "21053            Members of the Imperial Academy of Arts  \n",
      "\n",
      "[21054 rows x 2 columns]\n",
      "                    source_name                  dest_name\n",
      "0                  lasar-segall   Prussian Academy of Arts\n",
      "1                 alex-colville   Mount Allison University\n",
      "2                   alice-baber         Indiana University\n",
      "3               dan-christensen         Indiana University\n",
      "4        julio-romero-de-torres       Rafael Romero Barros\n",
      "..                          ...                        ...\n",
      "493            richard-hamilton  University College London\n",
      "494  alexandre-jacques-chantron              Salon (Paris)\n",
      "495                   paul-klee        List of art schools\n",
      "496              alfred-krupa-0        List of art schools\n",
      "497      thomas-francis-dicksee      Henry Perronet Briggs\n",
      "\n",
      "[498 rows x 2 columns]\n",
      "             source_name         dest_name\n",
      "0      utagawa-kuniyoshi           ukiyo-e\n",
      "1    tsukioka-yoshitoshi           ukiyo-e\n",
      "2     katsushika-hokusai           ukiyo-e\n",
      "3         elenore-abbott     scenic design\n",
      "4           marcel-janco     scenic design\n",
      "..                   ...               ...\n",
      "982          erin-hanson  contemporary art\n",
      "983     susan-rothenberg  contemporary art\n",
      "984        dumitru-gorzo  contemporary art\n",
      "985            alaa-awad        public art\n",
      "986        dumitru-gorzo        public art\n",
      "\n",
      "[987 rows x 2 columns]\n",
      "                  source_name                   dest_name\n",
      "0                   giorgione            giovanni-bellini\n",
      "1           sandro-botticelli               filippo-lippi\n",
      "2            anthony-van-dyck           peter-paul-rubens\n",
      "3                jan-van-eyck               robert-campin\n",
      "4             pietro-perugino        andrea-del-verrochio\n",
      "5            vincent-van-gogh                 anton-mauve\n",
      "6               henri-matisse  william-adolphe-bouguereau\n",
      "7               henri-matisse              gustave-moreau\n",
      "8           peter-paul-rubens              adam-van-noort\n",
      "9           peter-paul-rubens               otto-van-veen\n",
      "10          peter-paul-rubens            tobias-verhaecht\n",
      "11       zinaida-serebriakova                  ilya-repin\n",
      "12              alfred-sisley              charles-gleyre\n",
      "13                  jan-steen          adriaen-van-ostade\n",
      "14  pierre-puvis-de-chavannes              thomas-couture\n",
      "15             andrea-solario        antonello-da-messina\n",
      "16             giorgio-vasari            andrea-del-sarto\n",
      "17                  gwen-john      james-mcneill-whistler\n",
      "18                lee-krasner                hans-hofmann\n",
      "19                jimmy-ernst                   max-ernst\n",
      "20       janos-mattis-teutsch                 franz-stuck\n",
      "21                  eva-hesse                josef-albers\n",
      "22           robert-goodnough                hans-hofmann\n",
      "23              john-trumbull               benjamin-west\n",
      "24            nicolae-vermont                theodor-aman\n",
      "25          roberto-aizenberg               antonio-berni\n",
      "26             albert-marquet              gustave-moreau\n",
      "27        nicholas-krushenick                hans-hofmann\n",
      "28                 zao-wou-ki                lin-fengmian\n",
      "29               pinturicchio             pietro-perugino\n",
      "30            francisco-oller             gustave-courbet\n",
      "31            francisco-oller              thomas-couture\n",
      "32             nicolas-carone                hans-hofmann\n",
      "33        henry-ossawa-tanner               thomas-eakins\n",
      "34        henry-ossawa-tanner           benjamin-constant\n",
      "35               william-hart       jules-joseph-lefebvre\n",
      "36               henri-gervex           alexandre-cabanel\n",
      "37           mikhail-larionov               isaac-levitan\n",
      "38           mikhail-larionov              valentin-serov\n",
      "39                anna-ancher   pierre-puvis-de-chavannes\n",
      "40           hyacinthe-rigaud             charles-le-brun\n",
      "41    emanuel-gottlieb-leutze                karl-lessing\n",
      "42                  hans-gude           andreas-achenbach\n",
      "43  sophie-gengembre-anderson          charles-de-steuben\n",
      "44          theodore-robinson               carolus-duran\n",
      "45            filippino-lippi               filippo-lippi\n",
      "46              pompeo-batoni            sebastiano-conca\n",
      "           source_name                        dest_name\n",
      "0    bernard-van-orley              Margaret of Austria\n",
      "1           caravaggio               Alof de Wignacourt\n",
      "2       pieter-wenning                    Ernest Lezard\n",
      "3        henry-raeburn  George IV of the United Kingdom\n",
      "4        albert-tucker             John and Sunday Reed\n",
      "..                 ...                              ...\n",
      "119    rembrandt-peale                George Washington\n",
      "120          canaletto         Joseph Smith (1682–1770)\n",
      "121      henri-matisse                        Etta Cone\n",
      "122      benjamin-west         William Henry (delegate)\n",
      "123       claude-monet               Georges Clemenceau\n",
      "\n",
      "[124 rows x 2 columns]\n",
      "                                             source_name       dest_name\n",
      "0      marc-chagall_abraham-prostrated-himself-front-...             oil\n",
      "1                john-william-godward_yes-or-no-1893.jpg             oil\n",
      "2            william-merritt-chase_pulling-for-shore.jpg             oil\n",
      "3      cima-da-conegliano_doubting-thomas-with-st-mag...             oil\n",
      "4           jan-siberechts_a-pastoral-landscape-1684.jpg             oil\n",
      "...                                                  ...             ...\n",
      "83819              chris-ofili_pimpin-aint-easy-1997.jpg        map pins\n",
      "83820              chris-ofili_pimpin-aint-easy-1997.jpg   elephant dung\n",
      "83821              chris-ofili_pimpin-aint-easy-1997.jpg       polyester\n",
      "83822          chris-ofili_the-caged-birds-song-2017.jpg        tapestry\n",
      "83823          paul-gauguin_change-of-residence-1899.jpg  japanese paper\n",
      "\n",
      "[83824 rows x 2 columns]\n",
      "                                              source_name  \\\n",
      "0            boris-kustodiev_vegetables-merchant-1920.jpg   \n",
      "1       andre-derain_the-still-life-with-pumpkin-1939.jpg   \n",
      "2       zinaida-serebriakova_still-life-with-a-basket-...   \n",
      "3       gustave-courbet_still-life-with-pears-and-appl...   \n",
      "4       frans-snyders_still-life-with-fruit-basket-and...   \n",
      "...                                                   ...   \n",
      "342977      john-flaxman_william-pitt-earl-of-chatham.jpg   \n",
      "342978                       maria-fortuny_hollyhocks.jpg   \n",
      "342979                    james-rosenquist_disks-1963.jpg   \n",
      "342980             steve-kaufman_spiderman-iv-red-sky.jpg   \n",
      "342981                   beauford-delaney_jennie-1943.jpg   \n",
      "\n",
      "                    dest_name  \n",
      "0       fruits-and-vegetables  \n",
      "1       fruits-and-vegetables  \n",
      "2       fruits-and-vegetables  \n",
      "3       fruits-and-vegetables  \n",
      "4       fruits-and-vegetables  \n",
      "...                       ...  \n",
      "342977                  Medal  \n",
      "342978       Rosa wichuraiana  \n",
      "342979                   Hood  \n",
      "342980         Fantastic four  \n",
      "342981                Selling  \n",
      "\n",
      "[342982 rows x 2 columns]\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                                              source_name         dest_name\n",
      "0                        antonio-lopez_dead-girl-1957.jpg     antonio-lopez\n",
      "1                       antonio-lopez_artists-working.jpg     antonio-lopez\n",
      "2             antonio-lopez_sinforoso-and-josefa-1955.jpg     antonio-lopez\n",
      "3                anatoli-papian_portrait-of-anna-1983.jpg    anatoli-papian\n",
      "4           hans-richter_portrait-of-dora-rukser-1927.jpg      hans-richter\n",
      "...                                                   ...               ...\n",
      "116470   alexander-ivanov_portrait-of-vittoria-marini.jpg  alexander-ivanov\n",
      "116471                   alexander-ivanov_olive-trees.jpg  alexander-ivanov\n",
      "116472             alexander-ivanov_annunciation-1824.jpg  alexander-ivanov\n",
      "116473  alexander-ivanov_on-the-shore-of-the-bay-of-na...  alexander-ivanov\n",
      "116474  alexander-ivanov_joseph-interpreting-dreams-to...  alexander-ivanov\n",
      "\n",
      "[116475 rows x 2 columns]\n",
      "                                            source_name  \\\n",
      "0     albrecht-durer_treatise-on-measurement-1525-1.jpg   \n",
      "1       albrecht-durer_treatise-on-measurement-1525.jpg   \n",
      "2     albrecht-durer_treatise-on-measurement-1525-0.jpg   \n",
      "3     ivan-bilibin_sketch-for-the-opera-the-golden-c...   \n",
      "4     ivan-bilibin_sketch-for-the-opera-the-golden-c...   \n",
      "...                                                 ...   \n",
      "8317  alexandre-benois_flora-pool-in-versailles-1906...   \n",
      "8318                    alexandre-benois_versailles.jpg   \n",
      "8319         alexandre-benois_versailles-alley-1906.jpg   \n",
      "8320     alexandre-benois_versailles-water-parterre.jpg   \n",
      "8321  alexandre-benois_versailles-mirror-at-trianon.jpg   \n",
      "\n",
      "                                              dest_name  \n",
      "0     Instruction in measurement with compass and ru...  \n",
      "1     Instruction in measurement with compass and ru...  \n",
      "2     Instruction in measurement with compass and ru...  \n",
      "3                                    The Golden Cockere  \n",
      "4                                    The Golden Cockere  \n",
      "...                                                 ...  \n",
      "8317                                         Versailles  \n",
      "8318                                         Versailles  \n",
      "8319                                         Versailles  \n",
      "8320                                         Versailles  \n",
      "8321                                         Versailles  \n",
      "\n",
      "[8322 rows x 2 columns]\n",
      "                                              source_name        dest_name\n",
      "0       zinaida-serebriakova_menton-beach-with-umbrell...         art deco\n",
      "1                                    erte_autumn-song.jpg         art deco\n",
      "2                                       erte_feathers.jpg         art deco\n",
      "3                                john-austen_hamlet-6.jpg         art deco\n",
      "4                      zinaida-serebriakova_bath-1926.jpg         art deco\n",
      "...                                                   ...              ...\n",
      "116470       theodor-severin-kittelsen_noekken-1904-1.jpg  neo-romanticism\n",
      "116471  theodor-severin-kittelsen_kveld-paa-soletunet-...  neo-romanticism\n",
      "116472  theodor-severin-kittelsen_brudeferden-i-hardan...  neo-romanticism\n",
      "116473           stanley-spencer_sorting-laundry-1927.jpg  neo-romanticism\n",
      "116474           stanley-spencer_apple-gatherers-1913.jpg  neo-romanticism\n",
      "\n",
      "[116475 rows x 2 columns]\n",
      "                                              source_name           dest_name\n",
      "0       paul-jacoulet_le-chant-des-vagues-ponape-est-c...  nude painting (nu)\n",
      "1                               bela-czobel_muse-1930.jpg  nude painting (nu)\n",
      "2                otto-mueller_zwei-zigeunerinnen-1923.jpg  nude painting (nu)\n",
      "3                         eliseu-visconti_nu-feminino.jpg  nude painting (nu)\n",
      "4              william-merritt-chase_back-of-a-nude-1.jpg  nude painting (nu)\n",
      "...                                                   ...                 ...\n",
      "116470          robert-spencer_the-crowding-city-1925.jpg           cityscape\n",
      "116471  giovanni-battista-piranesi_the-roman-antiquiti...           cityscape\n",
      "116472                           william-turner_hafod.jpg           cityscape\n",
      "116473             gustave-loiseau_the-road-to-dieppe.jpg           cityscape\n",
      "116474          lajos-tihanyi_street-in-trencs-n-1912.jpg           cityscape\n",
      "\n",
      "[116475 rows x 2 columns]\n",
      "                                             source_name      dest_name\n",
      "0                 wayne-thiebaud_sunset-streets-1985.jpg  San Francisco\n",
      "1                richard-diebenkorn_woman-in-profile.jpg  San Francisco\n",
      "2                  richard-diebenkorn_berkeley-no-23.jpg  San Francisco\n",
      "3                richard-diebenkorn_ocean-park-no-54.jpg  San Francisco\n",
      "4                       clyfford-still_untitled-1948.jpg  San Francisco\n",
      "...                                                  ...            ...\n",
      "19527       hyacinthe-rigaud_louis-de-france-dauphin.jpg     Versailles\n",
      "19528  charles-andre-van-loo-carle-van-loo_marquise-d...     Versailles\n",
      "19529  charles-andre-van-loo-carle-van-loo_marie-lesz...     Versailles\n",
      "19530  louise-elisabeth-vigee-le-brun_marie-antoinett...     Versailles\n",
      "19531        franz-xaver-winterhalter_leopold-i-1840.jpg     Versailles\n",
      "\n",
      "[19532 rows x 2 columns]\n",
      "                                             source_name   dest_name\n",
      "0           berthe-morisot_julie-manet-and-her-nurse.jpg     Denmark\n",
      "1      gustave-courbet_three-english-girls-at-a-windo...     Denmark\n",
      "2             camille-pissarro_rue-saint-lazare-1897.jpg     Denmark\n",
      "3      christen-kobke_the-garden-steps-leading-to-the...     Denmark\n",
      "4                  christen-kobke_self-portrait-1833.jpg     Denmark\n",
      "...                                                  ...         ...\n",
      "19483          isaac-levitan_trunk-of-burgeoning-oak.jpg  Kyrgyzstan\n",
      "19484      isaac-levitan_landscape-with-an-isba-1899.jpg  Uzbekistan\n",
      "19485             nicholas-roerich_prince-knyaz-1916.jpg  Uzbekistan\n",
      "19486                 isaac-levitan_forest-sunny-day.jpg  Uzbekistan\n",
      "19487  anthony-van-dyck_portrait-of-maria-louisa-de-t...  Luxembourg\n",
      "\n",
      "[19488 rows x 2 columns]\n",
      "                                             source_name  \\\n",
      "0      jean-auguste-dominique-ingres_view-of-the-acro...   \n",
      "1      ford-madox-brown_john-wycliffe-reading-his-tra...   \n",
      "2                          joshua-reynolds_brown-boy.jpg   \n",
      "3          john-singer-sargent_mrs-ernest-hills-1909.jpg   \n",
      "4                       allan-ramsay_queen-charlotte.jpg   \n",
      "...                                                  ...   \n",
      "19499  amedeo-modigliani_jeanne-hebuterne-in-a-yellow...   \n",
      "19500          wassily-kandinsky_not_detected_189366.jpg   \n",
      "19501                 jackson-pollock_blue-moby-dick.jpg   \n",
      "19502            chaim-soutine_little-girl-with-doll.jpg   \n",
      "19503  jan-brueghel-the-elder_monkeys-feasting-singer...   \n",
      "\n",
      "                            dest_name  \n",
      "0                 Montauban Cathedral  \n",
      "1      Bradford Museums and Galleries  \n",
      "2      Bradford Museums and Galleries  \n",
      "3      Bradford Museums and Galleries  \n",
      "4                      Blickling Hall  \n",
      "...                               ...  \n",
      "19499             Ohara Museum of Art  \n",
      "19500             Ohara Museum of Art  \n",
      "19501             Ohara Museum of Art  \n",
      "19502       Hillman Family Foundation  \n",
      "19503       Rubens House (Rubenshuis)  \n",
      "\n",
      "[19504 rows x 2 columns]\n",
      "                                             source_name       dest_name\n",
      "0       aladar-korosfoi-kriesch_pupppet-theatre-1907.jpg         sadness\n",
      "1      zinaida-serebriakova_yevgeny-lanceray-in-a-sha...       amusement\n",
      "2            zinaida-serebriakova_self-portrait-1930.jpg  something else\n",
      "3      zinaida-serebriakova_princess-irina-yusupov-19...  something else\n",
      "4      zinaida-serebriakova_portrait-of-the-composer-...            fear\n",
      "...                                                  ...             ...\n",
      "65231               jean-degottex_chattigraphie-1974.jpg  something else\n",
      "65232                   gene-davis_untitled-150-1971.jpg  something else\n",
      "65233                    friedel-dzubas_durango-1968.jpg  something else\n",
      "65234            ellsworth-kelly_white-on-white-1951.jpg  something else\n",
      "65235                    agnes-martin_this-rain-1960.jpg  something else\n",
      "\n",
      "[65236 rows x 2 columns]\n",
      "                                            source_name             dest_name\n",
      "0     paul-gauguin_still-life-with-red-mullet-and-ju...           Early works\n",
      "1                    paul-gauguin_rouen-suburb-1884.jpg           Early works\n",
      "2     paul-gauguin_interior-of-the-painter-s-house-r...           Early works\n",
      "3            paul-gauguin_women-bathing-dieppe-1885.jpg           Early works\n",
      "4         paul-gauguin_still-life-with-oysters-1876.jpg           Early works\n",
      "...                                                 ...                   ...\n",
      "5743        luca-giordano_the-triumph-of-david-1682.jpg  Florence (1682-1692)\n",
      "5744  luca-giordano_the-martyrdom-of-saint-januarius...  Florence (1682-1692)\n",
      "5745      luca-giordano_young-bacchus-sleeping-1683.jpg  Florence (1682-1692)\n",
      "5746              luca-giordano_the-visitation-1683.jpg  Florence (1682-1692)\n",
      "5747      luca-giordano_marriage-of-the-virgin-1688.jpg  Florence (1682-1692)\n",
      "\n",
      "[5748 rows x 2 columns]\n",
      "                                  source_name    dest_name\n",
      "0                                 Ordrupgaard      Denmark\n",
      "1                              Skagens Museum      Denmark\n",
      "2                      Ny Carlsberg Glyptotek      Denmark\n",
      "3                       Randers Museum of Art      Denmark\n",
      "4           Natural History Museum of Denmark      Denmark\n",
      "...                                       ...          ...\n",
      "1100             P. and N. de Boer Foundation  Netherlands\n",
      "1101                         Groninger Museum  Netherlands\n",
      "1102  State museum of fine arts of Kyrgyzstan   Kyrgyzstan\n",
      "1103             Museum of Arts of Uzbekistan   Uzbekistan\n",
      "1104                       Grand Ducal Palace   Luxembourg\n",
      "\n",
      "[1105 rows x 2 columns]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:root:Saving on the disk all nodes\n",
      "INFO:root:Saving on the disk node mapping genre in path artgraph2bestemotions\\mapping\\genre_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping style in path artgraph2bestemotions\\mapping\\style_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping artist in path artgraph2bestemotions\\mapping\\artist_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping media in path artgraph2bestemotions\\mapping\\media_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping tag in path artgraph2bestemotions\\mapping\\tag_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping artwork in path artgraph2bestemotions\\mapping\\artwork_entidx2name.csv\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                                      source_name      dest_name\n",
      "0                          George Krevsky Gallery  San Francisco\n",
      "1                                 Legion of Honor  San Francisco\n",
      "2              Fine Arts Museums of San Francisco  San Francisco\n",
      "3     San Francisco Museum of Modern Art (SFMOMA)  San Francisco\n",
      "4                          Parma National Gallery          Parma\n",
      "...                                           ...            ...\n",
      "1104                           San Pietro Martire         Murano\n",
      "1105        Novosibirsk State Museum of Fine Arts    Novosibirsk\n",
      "1106           National Gallery of Victoria (NGV)      Melbourne\n",
      "1107                    Tver Regional Art Gallery           Tver\n",
      "1108                        Château de Versailles     Versailles\n",
      "\n",
      "[1109 rows x 2 columns]\n",
      "         source_name    dest_name\n",
      "0             Skagen      Denmark\n",
      "1          Humlebaek      Denmark\n",
      "2         Copenhagen      Denmark\n",
      "3            Randers      Denmark\n",
      "4          Blackburn           UK\n",
      "..               ...          ...\n",
      "603          Haarlem  Netherlands\n",
      "604          Otterlo  Netherlands\n",
      "605          Bishkek   Kyrgyzstan\n",
      "606         Tashkent   Uzbekistan\n",
      "607  Luxembourg City   Luxembourg\n",
      "\n",
      "[608 rows x 2 columns]\n",
      "Getting labels\n",
      "Writing mapping...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:root:Saving on the disk node mapping movement in path artgraph2bestemotions\\mapping\\movement_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping training in path artgraph2bestemotions\\mapping\\training_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping serie in path artgraph2bestemotions\\mapping\\serie_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping subject in path artgraph2bestemotions\\mapping\\subject_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping field in path artgraph2bestemotions\\mapping\\field_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping people in path artgraph2bestemotions\\mapping\\people_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping period in path artgraph2bestemotions\\mapping\\period_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping gallery in path artgraph2bestemotions\\mapping\\gallery_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping city in path artgraph2bestemotions\\mapping\\city_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping country in path artgraph2bestemotions\\mapping\\country_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping emotion in path artgraph2bestemotions\\mapping\\emotion_entidx2name.csv\n",
      "INFO:root:Saving on the disk node mapping rel in path artgraph2bestemotions\\mapping\\rel_entidx2name.csv\n",
      "INFO:root:Saving on the disk all relations\n",
      "INFO:root:Saving on the disk relation belongstomovement in path artgraph2bestemotions\\raw\\relations\\artist___belongstomovement___movement\n",
      "INFO:root:Saving on the disk relation hassubject in path artgraph2bestemotions\\raw\\relations\\artist___hassubject___subject\n",
      "INFO:root:Saving on the disk relation relatedtoschool in path artgraph2bestemotions\\raw\\relations\\artist___relatedtoschool___training\n",
      "INFO:root:Saving on the disk relation belongstofield in path artgraph2bestemotions\\raw\\relations\\artist___belongstofield___field\n",
      "INFO:root:Saving on the disk relation trainedby in path artgraph2bestemotions\\raw\\relations\\artist___trainedby___artist\n",
      "INFO:root:Saving on the disk relation haspatron in path artgraph2bestemotions\\raw\\relations\\artist___haspatron___people\n",
      "INFO:root:Saving on the disk relation madeof in path artgraph2bestemotions\\raw\\relations\\artwork___madeof___media\n",
      "INFO:root:Saving on the disk relation about in path artgraph2bestemotions\\raw\\relations\\artwork___about___tag\n",
      "INFO:root:Saving on the disk relation createdby in path artgraph2bestemotions\\raw\\relations\\artwork___createdby___artist\n",
      "INFO:root:Saving on the disk relation partof in path artgraph2bestemotions\\raw\\relations\\artwork___partof___serie\n",
      "INFO:root:Saving on the disk relation hasstyle in path artgraph2bestemotions\\raw\\relations\\artwork___hasstyle___style\n",
      "INFO:root:Saving on the disk relation hasgenre in path artgraph2bestemotions\\raw\\relations\\artwork___hasgenre___genre\n",
      "INFO:root:Saving on the disk relation locatedin in path artgraph2bestemotions\\raw\\relations\\artwork___locatedin___city\n",
      "INFO:root:Saving on the disk relation locatedin in path artgraph2bestemotions\\raw\\relations\\artwork___locatedin___country\n",
      "INFO:root:Saving on the disk relation locatedin in path artgraph2bestemotions\\raw\\relations\\artwork___locatedin___gallery\n",
      "INFO:root:Saving on the disk relation elicit in path artgraph2bestemotions\\raw\\relations\\artwork___elicit___emotion\n",
      "INFO:root:Saving on the disk relation hasperiod in path artgraph2bestemotions\\raw\\relations\\artwork___hasperiod___period\n",
      "INFO:root:Saving on the disk relation incountry in path artgraph2bestemotions\\raw\\relations\\gallery___incountry___country\n",
      "INFO:root:Saving on the disk relation incity in path artgraph2bestemotions\\raw\\relations\\gallery___incity___city\n",
      "INFO:root:Saving on the disk relation incountry in path artgraph2bestemotions\\raw\\relations\\city___incountry___country\n",
      "INFO:root:Saving on the disk node mapping train in path artgraph2bestemotions\\raw\\split\\artwork\\train.csv\n",
      "INFO:root:Saving on the disk node mapping test in path artgraph2bestemotions\\raw\\split\\artwork\\test.csv\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Writing labels...\n",
      "Writing info...\n",
      "Writing split...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:root:Saving on the disk node mapping valid in path artgraph2bestemotions\\raw\\split\\artwork\\valid.csv\n"
     ]
    }
   ],
   "source": [
    "artgraph = ArtGraphWithSplit(root='artgraph2bestemotions', conf=conf, queries=queries, labels=labels, split_paths=split_paths)\n",
    "artgraph.build()\n",
    "artgraph.write()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "923041fb",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [conda env:tesi]",
   "language": "python",
   "name": "conda-env-tesi-py"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
